test/loadtest/stress-quest.yml
config:
  target: 'http://localhost:8300'  # Cambia si tu API corre en otro puerto
  phases:
    - duration: 10  # duración de la prueba en segundos
      arrivalRate: 4  # usuarios virtuales por segundo
      name: "Calentamiento - 4 quests por segundo"
    - duration: 15  # duración de la prueba en segundos
      arrivalRate: 6  # usuarios virtuales por segundo
      name: "Carga media - 6 quests por segundo"
    - duration: 20  # duración de la prueba en segundos
      arrivalRate: 10  # usuarios virtuales por segundo
      name: "Carga pico - 10 quests por segundo"
  payload:
    path: './quests.csv'  # Datos de entrada para cada request
    fields:
      - "patientName"
      - "patientDni"
      - "jsonQuest"
      - "questType"
    cast: false
    order: sequence
    recycle: true
    skipHeader: true
  defaults:
    headers:
      Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IkNDNzI2NUEwLURBQjAtNDI5Mi04QkE2LTBEMzBBRDQ5MTRDNCIsInVzZXJuYW1lIjoiZHBydWViYWQiLCJlbWFpbCI6ImRwcnVlYmFjQGdtYWlsLmNvbSIsInJvbGVzIjoiMiIsImlhdCI6MTc1NTM3ODMwOCwiZXhwIjoxNzU1MzgxOTA4fQ.VwJS3nYDnjvR5Qa0t8eXfvI8KIUbDt_d7ta5-CkiXSw'  # Sustituye por un token válido
      Content-Type: 'application/json'
  http:
    timeout: 10           # Tiempo máximo de espera (segundos)
    maxSockets: 500       # Para evitar límite de conexiones
    pool: 200            # Mantener conexiones abiertas
    enableHttp2: false
  processor: './questprocessor.js'
  ensure:
    # Validaciones para saber si realmente llegaron todas las requests
    http.requests: 30
    errors.rate: 0.1  
scenarios:
  - name: Crear cuestionario
    flow:
      - log: "Enviando request con DNI: {{ patientDni }}"
      - post:
          url: '/quests/create'
          json:
            patientName: "{{ patientName }}"
            patientDni: "{{ patientDni }}"
            jsonQuest: "{{ jsonQuest }}"
            pdfName: "FAKE-NAME-{{ patientDni }}.pdf"
            questType: "{{ questType }}"
          capture:
            - json: "$"
              as: "response_body"
          afterResponse: "logAfterResponse"
      - log: "Request completada para DNI: {{ patientDni }}"